---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArrayArray.ForwardIterator
source: html/e8beeaac-d472-42b1-b2c0-029c72805991.htm
---
# Autodesk.Revit.DB.ReferenceArrayArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ReferenceArrayArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.